Revit 2024 API
PanelScheduleTemplate.IsDefault Property
 Checks to see if this is default template for the given panel schedule type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsDefault { get; }
Visual Basic
Public ReadOnly Property IsDefault As Boolean
	Get
Visual C++
public:
property bool IsDefault {
	bool get ();
}
See Also
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace